# Задайте список из N элементов, заполненных числами из промежутка [-N, N]. 
# Найдите произведение элементов на указанных позициях. 
# Позиции хранятся в файле file.txt в одной строке одно число.

# N = int(input("Type a number: "))
# N_list = []
# for i in range(-N, N+1):
#     N_list.append(int(i))
# print(N_list)